package com.logistical.fd.bean;

import java.util.ArrayList;

/**
 * Created by admin on 2016/8/11.
 */
public class BaseBean<T> {
    /**
     * 接口请求成功，返回码统一为10000
     接口请求失败，返回码参考
     //1、登录
     '10101' => '登录参数错误',
     '10102' => '登录失败',
     '10103' => '登录失效',
     '10104' => '您的账号已被登录',
     //2、忘记密码
     '10201' => '参数错误',
     '10202' => '密码设置失败',
     //3、获取用户信息
     '10301' => '用户信息获取失败',
     //4、修改密码
     '10401' => '参数错误',
     '10402' => '密码设置失败',
     //5、录入快递信息（收件、寄件）
     '10501' => '参数错误',
     '10502' => '请选定快递公司',
     '10503' => '未找到快递信息',
     '10504' => '该单号已经扫描，请不要重复扫描！',
     '10505' => '录入失败',
     '10506' => '没有权限！',
     //6、撤销录入（收件、寄件）
     '10601' => '参数错误',
     '10602' => '撤销失败',
     '10603' => '无权限操作该记录（只能由上一次扫描的用户扫描）',
     //7、疑难件类型列表
     '10701' => '参数错误',
     '10702' => '信息获取失败',
     //8、疑难件处理
     '10801' => '参数错误',
     '10802' => '未找到快递信息',
     '10803' => '处理失败',
     '10804' => '此快递状态为完成状态，不能修改成疑难件状态！',
     '10805' => '同一单号存在多个快递记录，快递公司不匹配，请选择其他快递公司！',
     '10806' => '此快递单号已是疑难件状态！',
     //9、客户取件处理
     '10901' => '参数错误',
     '10902' => '未找到快递信息',
     '10903' => '取件处理失败',
     '10904' => '没有权限！',
     '10905' => '此快递状态为完成状态，不能修改成其他状态！',
     '10906' => '有重复的快递，请选中其中一个快递公司',
     //10、批量录入收件信息
     '11001' => '参数错误',
     //11、批量录入寄件信息
     '11101' => '参数错误',
     //12、批量录入客户自取信息
     '11201' => '参数错误',
     '11202' => '没有权限！',
     //13、快递单列表（分页、查询）
     '11301' => '参数错误',
     '11302' => '信息获取失败',
     //14、快递单详情
     '11401' => '参数错误',
     '11402' => '信息获取失败',
     //15、快递公司列表
     '11501' => '参数错误',
     '11502' => '信息获取失败',
     //16、退出登录
     '11601' => '参数错误',
     */
    public int back_code;
    /**
     * 列表获取成功！
     */
    public String reason;

    public ArrayList<T> list;

    @Override
    public String toString() {
     return "BaseBean{" +
             "back_code=" + back_code +
             ", reason='" + reason + '\'' +
             ", list=" + list +
             '}';
    }

}
